**1)** Cria uma série de pandas que tenha os números inteiros de 0 a 100.

In [19]:
import numpy as np 
import pandas as pd

In [20]:
array = np.arange(0, 101)
array

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100])

In [21]:
serie = pd.Series(array)
serie

0        0
1        1
2        2
3        3
4        4
      ...
96      96
97      97
98      98
99      99
100    100
Length: 101, dtype: int64

**2)** Considere uma série de notas de alunos:
 
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
Determine:

**a)** A nota média

**b)** O desvio padrão

**c)** A moda

**d)** A mediana

In [41]:
notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])

In [23]:
# Nota média

media = notas.mean().round(2).tolist()
media

7.19

In [24]:
# Desvio Padrão

desvio = notas.std().round(2).tolist()
desvio

2.43

In [25]:
# Moda

moda = notas.mode().round(2).tolist()
moda

[9.0]

In [26]:
# Mediana

mediana = notas.median().round(2).tolist()
mediana

8.0

In [28]:
notas.describe().round(2)

count    36.00
mean      7.19
std       2.43
min       0.00
25%       5.75
50%       8.00
75%       9.00
max      10.00
dtype: float64

In [42]:
notas.value_counts(normalize=True, bins=5).mul(100).round(2).astype(str) + ' %'

(8.0, 10.0]      41.67 %
(6.0, 8.0]       30.56 %
(4.0, 6.0]       19.44 %
(-0.011, 2.0]     5.56 %
(2.0, 4.0]        2.78 %
Name: proportion, dtype: object

### Transforme o dicionário abaixo em um DataFrame.
dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],
              'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

In [1]:
import pandas as pd 

dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

df = pd.DataFrame(dictionary)
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

In [3]:
# Tamanho do dataset
df.shape

(9, 2)

In [5]:
# Colunas do dataset
df.columns

# passando para lista
df.columns.tolist()

['Alunos', 'Notas']

In [6]:
#Filtros
df['Notas']

0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [7]:
#Iterar pelas colunas
# útil para fazer tratamento de dataset

for coluna in df.columns:
    print(df[coluna])

0    Sandro
1    Rafael
2     Tiago
3     André
4    Camila
5       Teo
6    Carlos
7      Juca
8     Carla
Name: Alunos, dtype: object
0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [8]:
# Filtragem, buscando um dado específico

df[ df['Alunos'] == 'Camila' ]

# df[]: dataframe
# df['Alunos']: na coluna (Alunos)
# e== igual
# 'Camila'

   Alunos  Notas
4  Camila    9.5

In [10]:
# Notas de alunos entre 5 e 8

df[(df['Notas']>5) & (df['Notas']<8)]

  Alunos  Notas
3  André    7.5
7   Juca    6.5

In [11]:
# Pegando a nota máxima

df[ df['Notas'] == df['Notas'].max() ]

   Alunos  Notas
1  Rafael   10.0
5     Teo   10.0
8   Carla   10.0

In [13]:
# Buscando valores específicos

lista_notas = [5.,8.,10.]

df[ ~df['Notas'].isin(lista_notas)]

   Alunos  Notas
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
7    Juca    6.5

#### GroupyBy

In [14]:
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

### Para o Dataframe de Alunos utilizado

**1)** Encontre a nota média dos alunos

In [16]:
media = df['Notas'].mean().round(2)
print(f'A nota média dos alunos é: {media}')

A nota média dos alunos é: 8.44

**2)** A nota do Juca

In [17]:
nota_juca = df['Notas'].loc[7]
print(f'A nota do Juca é: {nota_juca}')

A nota do Juca é: 6.5

**3)** Os alunos com nota menor que 6.5

In [21]:
menor = df[df['Notas'] < 6.5]

**4)** Peça a descrição das notas para ter insights interessantes

In [23]:
df['Notas'].describe().round(2)

count     9.00
mean      8.44
std       1.81
min       5.00
25%       7.50
50%       9.50
75%      10.00
max      10.00
Name: Notas, dtype: float64

**5)** A moda das notas acima de 7

In [39]:
acima_7 = df[df['Notas'] > 7]
moda = acima_7['Notas'].mode()
moda
print(f'A moda das notas acima de 7 é: {moda[0]}')

A moda das notas acima de 7 é: 10.0

#### Carregue o CSV Titanic

In [44]:
df_titanic = pd.read_csv('../aula_4/titanic.csv')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [46]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
df_titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [55]:
df_titanic.shape
print(f'O dataset tem {df_titanic.shape[0]} linhas e {df_titanic.shape[1]} colunas')

O dataset tem 891 linhas e 12 colunas

In [57]:
df_titanic.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 285.6 KB

In [59]:
# Crio uma lista das colunas que quero ver
exibir = ['Survived', 'Name','Sex', 'Age']

#indexo o dataframe com a lista que criei
df_titanic[exibir]

     Survived                                               Name     Sex   Age
0           0                            Braund, Mr. Owen Harris    male  22.0
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2           1                             Heikkinen, Miss. Laina  female  26.0
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4           0                           Allen, Mr. William Henry    male  35.0
..        ...                                                ...     ...   ...
886         0                              Montvila, Rev. Juozas    male  27.0
887         1                       Graham, Miss. Margaret Edith  female  19.0
888         0           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889         1                              Behr, Mr. Karl Howell    male  26.0
890         0                                Dooley, Mr. Patrick    male  32.0

[891 rows x 4 columns]

In [63]:
mortos = df_titanic['Survived'] == 0
df_titanic[mortos]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [64]:
vivos = df_titanic['Survived'] != 0
df_titanic[vivos]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [77]:
first_class = df_titanic[df_titanic['Pclass'] == 1].shape
second_class = df_titanic[df_titanic['Pclass'] == 2].shape
third_class = df_titanic[df_titanic['Pclass'] == 3].shape
first_class

print(f'Número de passageiros da primeira classe: {first_class[0]} pessoas.\nNúmero de passageiros da segunda classe: {second_class[0]} pessoas.\nNúmero de passageiros da terceira classe: {third_class[0]} pessoas.')

Número de passageiros da primeira classe: 216 pessoas.
Número de passageiros da segunda classe: 184 pessoas.
Número de passageiros da terceira classe: 491 pessoas.

In [78]:
# Exibir nome das colunas
df_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [86]:
# Vendo em qual porto o passageiro embarcou

#C: Cherbourg, na França.
#S: Southampton, no Reino Unido

df_titanic[df_titanic['Embarked'] == 'C'].shape

(168, 12)

In [92]:
df_titanic.groupby('Embarked').size()

Embarked
C    168
Q     77
S    644
dtype: int64

In [88]:
# Tarifa
df_titanic['Fare'].sort_values()

815      0.0000
806      0.0000
413      0.0000
481      0.0000
302      0.0000
         ...
438    263.0000
341    263.0000
737    512.3292
679    512.3292
258    512.3292
Name: Fare, Length: 891, dtype: float64